Tekla.Structures.Model.ChangeData
The ChangeData class presents information about the detected change of the modelobject in the model. It is instantiated inside the connected method.

Tekla.Structures.Model.ChangeData.Object
Gets the changed object.

Tekla.Structures.Model.ChangeData.Type
Gets the change type.

Tekla.Structures.Model.ChangeData.Source
Gets the change source type.